# f9.py　第九条　資格喪失の時期

from essentials import *
from f7 import 被扶養配偶者,第一号被保険者,第二号被保険者,第三号被保険者,被保険者

被保険者資格喪失=(lambda d:
       If(OR(AND(第二号,OR(第二号被保険者,第三号被保険者)),
             OR(第三号,第四号,第五号))(d),
          True,
          OR(第一号,第二号,第三号,第四号,第五号,第六号)(d-1)))

六十歳=lambda d:本人.年齢(d)==60
死亡=lambda d:False
第一号=成立に至る(死亡)
第二号=成立に至る(AND(NOT(日本国内に住所を有する),
                    NOT(OR(第二号被保険者,第三号被保険者))))
第三号=成立に至る(AND(六十歳,NOT(第二号被保険者)))
第四号=成立に至る(AND(厚生年金保険法老齢等受給可能,
                    NOT(OR(第二号被保険者,第三号被保険者))))
第五号=成立に至る(AND(NOT(厚生年金保険の被保険者),NOT(被保険者)))
第六号=成立に至る(AND(NOT(被扶養配偶者),
                    NOT(OR(第一号被保険者,第二号被保険者))))
