#################
# honnin_v28.py #
#################

# 第二十八条の検証で使用
# 1年2日と単純化し，65才の誕生日を起点とする通日により日dを表現
# 年齢=lambda d:65+d/2

from essentials import *

誕生日=130
六十五才に達した日=年齢到達日(65,誕生日)
六十六才に達した日=年齢到達日(66,誕生日)
七十才に達した日=年齢到達日(70,誕生日)

老齢基礎年金の受給権者=lambda d:d>=0
障害基礎年金の受給権者=lambda d:d>=6
遺族基礎年金の受給権者=lambda d:False
付加年金の受給権者=lambda d:False
老齢を支給事由とするものを除く厚生年金受給権者=lambda d:False
老齢基礎年金請求日=20
支給繰下げ申出日=12

# 上の条件に対する検証結果と条件の順序関係を図示したもの
# sat [dd = 6]
# 年齢　65        66        67        68        69        70          71
# d  　 0----1----2----3----4----5----6----7----8----9----10----11----12---
#       |                             |                               |
#   老齢支給事由                     障害支給事由                   　　繰下げ申出
#                                     |
#                                     V
#                             　　支給繰下げ申請みなし日

# 以下は，各条件の順序関係などを変化させた場合の結果を染ます．

# 障害基礎年金の受給権者=lambda d:False
# 支給繰下げ申出日=12
# sat [dd = 10]
# 年齢　65        66        67        68        69        70          71
# d  　 0----1----2----3----4----5----6----7----8----9----10----11----12---
#       |                                                  |          |
#   老齢支給事由                                             | 　    　繰下げ申出
#                                                          V
#                                                支給繰下げ申請みなし日

# 障害基礎年金の受給権者=lambda d:False
# 支給繰下げ申出日=7
# sat [dd = 7]
# 年齢　65        66        67        68        69        70          71
# d  　 0----1----2----3----4----5----6----7----8----9----10----11----12---
#       |                                  |
#   老齢支給事由                         繰下げ申出
#                                          |
#                                          V
#　　　　　　　　　　　　　　　　　　　　　　支給繰下げ申請みなし日

# 老齢基礎年金請求=lambda d:d==1
# 支給繰下げ申出=lambda d:d==12
# unsat
# 年齢　65        66        67        68        69        70          71
# d  　 0----1----2----3----4----5----6----7----8----9----10----11----12---
#       |    |                                                        |
#  老齢支給事由|                                              　   　繰下げ申出
#          老齢受給請求
#                                     支給繰下げ申請みなし日：なし
