# honnin_AB
# 第二十条併給の調整の検証で使用

#from essentials import *
from z3 import *

A年金受給権利発生=(lambda d: d==10000)
A年金受給権利消滅=(lambda d: d==14000)
A年金停止解除申請=(lambda d: d==12000)
B年金受給権利発生=(lambda d: d==10500)
B年金受給権利消滅=(lambda d: d==12000)
B年金停止解除申請=(lambda d: d==10500)

#        *---------- A -------------------------------------*
#        |          *------ B ----------*                   |
#        |          |                   |                   |
#     A受給権発生  B受給権発生           B受給権利消滅         A受給権利消滅
#  ------*----------*-------------------*-------------------*-------
#   d: 10000      10500                12000               14000
#        |         B支給事由発生
#        |          |   |B停止事由発生後，停止解除申請
#        |          |   V
#        |　　　　　　|  B受給 m351=10500/30+1
#        |          |  """""""""""""""""""""
#        V          V
#  A支給事由発生　　A停止事由発生　　
#          |        |
#          *- A支給-*
#   　　　m335     m350=10500/30
#   =100000/30+1    |
#                   V
#               A停止解除みなし申請
#                       |
#                       V
#                      A受給 m351
#　                    """""""""""
